Autodesk.Revit.DB.ACAObjectPreference
An enumerated type listing possible ways to generate geometry of an ACA object
Revit object parameters used to generate geometry of the exported ACA object.
Revit object geometry is used to generate geometry of the exported ACA object. That may produce better geometric fidelity in some cases.